tap "felixkratz/formulae"
tap "libsql/sqld"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "supabase/tap"
tap "thezoraiz/ascii-image-converter"
tap "tursodatabase/tap"
# Run your GitHub Actions locally
brew "act"
# Command-line interface for SQLite
brew "sqlite"
# AI pair programming in your terminal
brew "aider"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# Glamorous shell scripts (Charmbracelet)
brew "gum"
# Terminal markdown renderer (Charmbracelet)
brew "glow"
# Local LLM runtime (run via `brew services start ollama`)
brew "ollama"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# New way to see and navigate directory trees
brew "broot"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Power of curl, ease of use of httpie
brew "curlie"
# Load/unload environment variables based on $PWD
brew "direnv"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# mise — polyglot version manager (replaces fnm + pyenv)
brew "mise"
# Fast and simple Node.js version manager (kept as fallback during mise rollout)
brew "fnm"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Version Control Visualization Tool
brew "gource"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Development framework for multimedia applications
brew "gstreamer"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Simple terminal UI for git commands
brew "lazygit"
# Powerful, lightweight programming language
brew "lua"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Music Player Daemon
brew "mpd"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Command-line Git information tool
brew "onefetch"
# Outputs current CPU temperature for OSX
brew "osx-cpu-temp"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Draw UML diagrams
brew "plantuml"
# Paste PNG into files
brew "pngpaste"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Modern replacement for ps written in Rust
brew "procs"
# Python version management
brew "pyenv"
# Command-line interface for Render
brew "render"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal based Media Player Client with album art support
brew "rmpc"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Incremental parsing library
brew "tree-sitter"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Supabase CLI
brew "supabase/tap/supabase"
# Convert images into ascii art
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
brew "tursodatabase/tap/turso"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS (tap declared above)
cask "aerospace"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Display management tool
cask "betterdisplay"
# Terminal-based AI coding assistant
cask "claude-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-pro"
# GPU-accelerated terminal emulator (primary terminal)
cask "ghostty"
# Open-source keystroke visualiser
cask "keycastr"
# System-wide text expander (Rust)
cask "espanso"
# Clipboard history manager (Cmd+Shift+C to open)
cask "maccy"
# Customise mouse behavior
cask "linearmouse"
# System monitor for the menu bar
cask "stats"
# Menu bar customization tool
cask "swiftbar"
# Inter sans-serif typeface (used by sketchybar / design tokens)
cask "font-inter"
# Manrope sans-serif typeface (used by design tokens / site)
cask "font-manrope"
# GPU-accelerated terminal emulator (alternate, used for streamdeck workflows)
cask "kitty"
# Xcode project generator (Swift / iOS dev)
cask "tuist"
# Apache Ant build tool (Java legacy build chain)
cask "ant"
vscode "aaravb.chrome-extension-developer-tools"
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "asciidoctor.asciidoctor-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "humao.rest-client"
vscode "idleberg.icon-fonts"
vscode "ionutvmi.path-autocomplete"
vscode "jakebecker.elixir-ls"
vscode "james-yu.latex-workshop"
vscode "juanblanco.solidity"
vscode "kamikillerto.vscode-colorize"
vscode "lokalise.i18n-ally"
vscode "mathematic.vscode-latex"
vscode "mathiasfrohlich.kotlin"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "mikestead.dotenv"
vscode "mjmcloug.vscode-elixir"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "runem.lit-plugin"
vscode "scala-lang.scala"
vscode "selcuk-usta.code-complexity-report-generator"
vscode "seojunyoo.react-component-preview"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "snappify.snappify"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "svelte.svelte-vscode"
vscode "systemticks.c4-dsl-extension"
vscode "tamasfe.even-better-toml"
vscode "thomascsd.vscode-readme-pattern"
vscode "tobiasalthoff.atom-material-theme"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "tyriar.lorem-ipsum"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
vscode "zeshuaro.vscode-python-poetry"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/danielmiessler/fabric/cmd/fabric"
go "github.com/projectdiscovery/naabu/v2/cmd/naabu"
go "honnef.co/go/tools/cmd/staticcheck"

# Wallpaper / desktop integration
tap "theboredteam/boring-notch"
brew "wallpaper"                                # CLI for desktop wallpaper (Sindre Sorhus)
cask "ubersicht"                                # Webview widgets above wallpaper
cask "boring-notch"                             # Notch utility (Dynamic-Island clone, OSS)
# Note: Plash is Mac App Store only — install from https://sindresorhus.com/plash
